// Κλάση Μοντέλου για τις Κατηγορίες (Σχετίζεται με την ΠΧ1).
// Ορίζει τη δομή των δεδομένων για κάθε κατηγορία εξόδων.
class Category {
  int? id;             // Ο μοναδικός αναγνωριστικός αριθμός (Primary Key στην SQLite).
  String title;        // Ο τίτλος της κατηγορίας
  String? description; // Προαιρετική περιγραφή για επιπλέον λεπτομέρειες.
  int position;        // Προσθήκη της ιδιότητας (ΟΧΙ final για να αλλάζει στο reorder)

  // Constructor: Ο κατασκευαστής της κλάσης. Το 'required' στον τίτλο διασφαλίζει ότι δεν θα δημιουργηθεί κατηγορία χωρίς όνομα.
  Category({
    this.id,
    required this.title,
    this.description,
    this.position = 0, // Προεπιλεγμένη τιμή στον constructor
  });

  // Μέθοδος fromMap: Μετατρέπει τα δεδομένα από τη βάση πίσω σε αντικείμενο Dart.
  // Η SQLite επιστρέφει τα δεδομένα σε μορφή Map (σαν λεξικό). Αυτή η μέθοδος ανακτά τα δεδομένα από το Map της βάσης και δημιουργεί ένα αντικείμενο Category.
  factory Category.fromMap(Map<String, dynamic> map) {
    return Category(
      id: map['id'],
      title: map['title'],
      description: map['description'],
      position: map['position'] ?? 0, // Διαβάζουμε τη νέα στήλη - Αν η τιμή είναι null στη βάση, θέτουμε 0.
    );
  }

  // Μέθοδος toMap: Μετατρέπει το αντικείμενο Category σε Map (ζεύγη key-value).
  // Η βιβλιοθήκη sqflite απαιτεί αυτή τη μορφή για να εκτελέσει Insert ή Update στη βιβλιοθήκη sqflite, καθώς η SQLite δέχεται τα δεδομένα σε αυτή τη μορφή.
  Map<String, dynamic> toMap() {
    return {
      'id': id,
      'title': title,
      'description': description,
      'position': position, // Περιλαμβάνεται για την αποθήκευση της σειράς κατάταξης.
    };
  }
}

/*
  Είναι το "καλούπι" (Model) των κατηγοριών. Ο ρόλος του είναι:
  α) Τυποποίηση: Ορίζει ακριβώς ποια χαρακτηριστικά έχει μια κατηγορία (id, τίτλο, περιγραφή, θέση) ώστε να υπάρχει ομοιομορφία σε όλη την εφαρμογή.
  β) Γέφυρα Δεδομένων: Λειτουργεί ως ενδιάμεσος σταθμός μεταξύ της βάσης δεδομένων (που μιλάει με Maps) και του UI της Flutter (που χρησιμοποιεί αντικείμενα Dart).
  γ) Διαχείριση Reordering: Μέσω της ιδιότητας position, επιτρέπει στην εφαρμογή να "θυμάται" τη σειρά με την οποία ο χρήστης έχει τοποθετήσει τις κατηγορίες στη λίστα.
*/